*> Copybook für den Produktstamm (Länge: 33 Zeichen)
       01 PRO-PRODUKTSTAMM-REC.
          05 PRO-PRODUKTNUMMER     PIC 9(06).
          05 PRO-BEZEICHNUNG       PIC X(20).
          05 PRO-PREIS             PIC S9(05)V99.