      *> Copybook für die Bestellungen (Länge: 17 Zeichen)
       01 BES-BESTELLUNG-REC occurs 100 times.
          05 BES-KUNDENNUMMER      PIC 9(06).
          05 BES-PRODUKTNUMMER     PIC 9(06).
          05 BES-MENGE             PIC 9(05).
          