      *> Copybook für die Bestellungen (Länge: 18 Zeichen)
          10 BES-KUNDENNUMMER      PIC 9(06).
          10 BES-PRODUKTNUMMER     PIC 9(06).
          10 BES-MENGE             PIC 9(06).
