      *> Copybook für den Produktstamm (Länge: 33 Zeichen)
          10 PRO-PRODUKTNUMMER     PIC 9(06).
          10 PRO-BEZEICHNUNG       PIC X(20).
          10 PRO-PREIS             PIC S9(06)V99.
          10 PRO-FILLER            PIC X(01).
